       01 WID-ARQ-VENDEDOR.
000380     05 WNM-PATH-VENDEDOR PIC X(17) VALUE "C:\code\cobol\db\".
           05 WNM-ARQ-VENDEDOR PIC X(50) VALUE "VENDEDORES_OUT.IDX".
