       01 WID-ARQ-CLIENTE.
000380     05 WNM-PATH-CLIENTE PIC X(17) VALUE "C:\code\cobol\db\".
           05 WNM-ARQ-CLIENTE PIC X(50) VALUE "CLIENTES_OUT.IDX".
