       01 LK-DIST-PARAMETERS.
           05 LK-LATITUDE-ORI     PIC S9(4)V9(8).
           05 LK-LONGITUDE-ORI    PIC S9(4)V9(8).
           05 LK-LATITUDE-DES     PIC S9(4)V9(8).
           05 LK-LONGITUDE-DES    PIC S9(4)V9(8).
      *    RETORNO
           05 LK-DIST-RC-S        PIC 99 VALUE 0.
           05 LK-DIST-KM-S        PIC S9(8)V9(11).
